01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 REDEFINES WS-AREA-1 PIC X(100). 
01  WS-NUMERIC-AREA PIC 9(100). 

PROCEDURE DIVISION. 
    MOVE 'Hello, World!' TO WS-AREA-1 
    DISPLAY WS-AREA-1 
    IF WS-AREA-1 NUMERIC THEN 
        MOVE WS-AREA-1 TO WS-NUMERIC-AREA 
        DISPLAY WS-NUMERIC-AREA 
    ELSE 
        DISPLAY "Data is not numeric" 
    END-IF
    STOP RUN.